Repository: Oleg-Soloviov/heroku
Catalog: portfolio/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Email..
ru: Ваш Email

source: Subject..
ru: Тема письма

source: Message...
ru: Ваше сообщение

source: <h4>Django-tinymce.</h4><p>&quot;Django-tinymce&quot; is a Django application that contains a widget to render a form field as a TinyMCE editor. It uses TinyMCE editor 3.5.11. Current version of TinyMCE editor is TinyMCE&nbsp;4.5.x. and you need only two scripts in HEAD section of HTML document <a href="{% url 'portfolio:tinymce' 'tinymce4' %}">to convert</a> any your field in rich text editor.</p>
ru: <h4>Django-tinymce.</h4><p>&quot;Django-tinymce&quot; это приложение Django, которое содержит виджет, чтобы превратить поле формы в редактор TinyMCE. Используется версия 3.5.11 редактора TinyMCE. Текущая версия TinyMCE редактора&nbsp;-&nbsp;4.5.x. Для его установки нужно только два скрипта в разделе HEAD HTML документа и ваше поле формы <a href="{% url 'portfolio:tinymce' 'tinymce4' %}">превратится</a> в редактор форматированного текста.</p>

source: <h4>TinyMCE 4.</h4><p>Tiny MCE 4 is a platform independent web-based JavaScript HTML WYSIWYG editor. TinyMCE enables you to convert HTML textarea fields or other HTML elements to editor instances. Current version of TinyMCE editor is TinyMCE&nbsp;4.5.x. and you need only two scripts in HEAD section of HTML document to enable it.</p>
ru: <h4>TinyMCE 4.</h4><p>Tiny MCE 4 это платформо независимый JavaScript HTML WYSIWYG редактор для интернета. TinyMCE дает возможность превратить поле textarea в полноценный редактор. Текущая версия редактора TinyMCE&nbsp;4.5.x. Чтобы использовать его нужно только два тега scripts разделе HEAD HTML документа.</p>

source: <h4>NicEdit.</h4><p>NicEdit is a Lightweight, Cross Platform, Inline Content Editor to allow easy editing of web site content on the fly in the browser.</p>
ru: <h4>NicEdit.</h4><p>NicEdit это легкий, межплатформенный онлайн редактор, который позволяет легко редактировать содержимое вебсайта прямо в браузере.</p>

source: <h4>CKEditor.</h4><p>CKEditor is a browser-based WYSIWYG content editor. It brings to the web common word processor features found in desktop editing applications like Microsoft Word and OpenOffice. </p>
ru: <h4>CKEditor.</h4><p>CKEditor это браузерный WYSIWYG редактор контента. Он предоставляет для интернета основные черты &quot;больших&quot; десктопных приложений для редактирования текста, таких как Microsoft Word и OpenOffice.</p>

source: <h4 class='text-primary'>TextInput based fields.</h4><p>These Django fields use <strong>TextInput</strong> as a default widget, so only <em>required</em>, <em>max_length</em> and <em>min_length</em> properties are validated by browsers. Try to input the wrong value and submit the form - browser validation will not warn you about an error and you will get a Django validation error.</p><div class='panel panel-info'><div class='panel-body'>All <a href='{% url 'portfolio:django_forms' 'date-time-fields' %}'>time and date</a> Django fields use text inputs.</div></div>
ru: <h4 class='text-primary'>Поля на основе TextInput.</h4><p>Для этих полей Django использует <strong>TextInput</strong> в качестве виджета по умолчанию, поэтому браузеры проверяют поля только на соответствие свойствам <em>required</em>, <em>max_length</em> и <em>min_length</em>. Попробуйте ввести неверное значение и отправить форму&nbsp;-&nbsp;браузер не предупредит вас об ошибке и вы получите ошибку валидации Django.</p><div class='panel panel-info'><div class='panel-body'>Все поля Django для <a href='{% url 'portfolio:django_forms' 'date-time-fields' %}'>времени и даты</a> используют <strong>TextInput</strong> виджет по умолчанию.</div></div>

source: any char or sign
ru: любой знак, буква или цифра

source: only letters, numbers, underscores, and hyphens
ru: только буквы, цифры, подчеркивание или тире

source: string with "foo" substring
ru: строка с подстрокой "foo"

source: Submit
ru: Отправить

source: Reset
ru: Очистить

source: <h4 class='text-primary'>HTML5 input types.</h4><p>&quot;If your form includes an URLField, an EmailField or any integer field type, Django will use the url, email and number HTML5 input types. By default, browsers may apply their own validation on these fields, which may be stricter than Django’s validation. If you would like to disable this behavior, set the <strong>novalidate</strong> attribute on the form tag, or specify a different widget on the field, like TextInput&quot; (<a href='https://docs.djangoproject.com/en/1.10/topics/forms/#working-with-forms' target='_blank'>Django Documentation <span class='glyphicon glyphicon-new-window' aria-hidden='true'></span></a>)</p><p>Browsers apply their own validation on these fields. For any integer field <strong>Field.localize</strong> must be <strong>False</strong>. Try to input the wrong value and submit the form - browser validation will warn you about an error in the first wrong field.</p>
ru: <h4 class='text-primary'>HTML5 поля.</h4><p>&quot;Если в вашей форме есть поля URLField, EmailField, либо одно из цифровых полей, то Django будет использовать HTML5 поля: url, email и number соответственно. По умолчанию, браузеры могут осуществлять свою проверку этих полей, которая может быть даже строже, чем проверка (валидация) Django. Если вы хотите отключить эту проверку, то установите атрибут <strong>novalidate</strong> самой формы, или используйте другой виджет для этого поля, например TextInput&quot; (<a href='https://docs.djangoproject.com/en/1.10/topics/forms/#working-with-forms' target='_blank'>Django Documentation <span class='glyphicon glyphicon-new-window' aria-hidden='true'></span></a>)</p><p>Браузеры осуществляют свою проверку этих полей. Для любого числового поля <strong>Field.localize</strong> должно быть установлено в значение <strong>False</strong>. Попробуйте ввести неправильное значение и отправить форму&nbsp;-&nbsp;браузер предупредит вас об ошибке в первом по счету поле с неправильным значением.</p>

source: valid URL
ru: правильный URL адрес

source: valid Email
ru: правильный Email адрес

source: integer between 10 and 100 - required
ru: целое число от 10 до 100 (обязательное поле)

source: float between 1.44 and 3.14
ru: число от 1.44 до 3.14

source: digits: 6, decimal places: 2 == 1234.56
ru: целых: 6, десятичных: 2 == 1234.56

source: <h4 class='text-primary'>Boolean and Choice fields.</h4><p>These Django fields let you make a choice. If you want to include a boolean in your form that can be either <strong>True</strong> or <strong>False</strong> (e.g. a checked or unchecked checkbox), you must remember to pass in <strong>required=False</strong> when creating the <strong>BooleanField</strong>.</p>
ru: <h4 class='text-primary'>Поля выбора.</h4><p>Эти поля Django позволяют вам сделать выбор. Если вы намерены включить в cвою форму поле <strong>checkbox</strong>, которое может быть либо <strong>True</strong>, либо <strong>False</strong> (т.е. флажок отмечен или нет), то необходимо, определяя поле <strong>BooleanField</strong> установить <strong>required=False</strong>.</p>

source: a string which can be converted into a timedelta: DD HH:MM:SS
ru: строка, которая может быть преобразована в <strong>timedelta</strong>: ДД ЧЧ:ММ:СС

source: <h4 class='text-primary'>Time and Date Django fields.</h4><p>Django uses <strong>TextInput</strong> as a default widget for date and time fields, so only <em>required</em>, <em>max_length</em> and <em>min_length</em> properties are validated by browsers. Try to input the wrong value and submit the form&nbsp;-&nbsp;browser validation will not warn you about an error and you will get a Django validation error.</p><p>Each field accepts <strong>format</strong> optional argument. If no format argument is provided the first format found in DATE(TIME)_INPUT_FORMATS settings will be used.</p>
ru: <h4 class='text-primary'>Django поля для даты и времени.</h4><p>Django использует <strong>TextInput</strong> как виджет по умолчанию для полей даты и времени, поэтому только свойства <em>required</em>, <em>max_length</em> и <em>min_length</em> проверяются браузерами. Попробуйте ввести неверное значение в поле и отправить форму&nbsp;-&nbsp;браузер не предупредит вас о неверном значении и вы увидите только сообшение Django об ошибке.</p><p>В каждом таком поле устанавливается необязательное свойство <strong>format</strong>. Если оно не установлено, то будет использовано первое значение, найденное в переменной DATE(TIME)_INPUT_FORMATS модуля <strong>settings</strong> Django.</p>

source: 14:30:59 or 14:30
ru: 14:30:59 или 14:30

source: 2006-10-25 14:30:59 (YYYY-MM-DD HH:MM:SS)
ru: 2006-10-25 14:30:59 (ГГГГ-ММ-ДД ЧЧ:ММ:СС)

source: 2017-03-19 (YYYY-MM-DD)
ru: 2017-03-19 (ГГГГ-ММ-ДД)

source: Page not found
ru: Страница не найдена (404)

source: Server Error (500)
ru: Ошибка сервера (500)

source: My portfolio site
ru: Мой портфолио сайт

source: Change
ru: Сменить

source: Send me your letter.
ru: Пошлите мне письмо

source: To send a letter fill the form.
ru: Чтобы послать письмо заполните форму.

source: Send
ru: Послать

source: Django form fields.
ru: Поля Django

source: The Django forms library comes with a set of Field classes that represent common validation needs.
ru: Django фреймворк содержит библиотеку полей HTML форм, реализующих основные случаи проверки (валидации) полей.

source: View details
ru: Подробности

source: All Django form fields.
ru: Все поля Django для форм

source: A full set of Django form fields
ru: Все поля Django для форм

source: TextInput fields
ru: Поля TextInput

source: Time and Date
ru: Время и Дата

source: HTML5 input
ru: HTML5 поля

source: Choice fields
ru: Поля выбора

source: I am a web developer: Python, Django, HTML, CSS, JavaScript, Bootstrap, SQL, PostgreSQL, MySQL, Linux&nbsp;(Debian,&nbsp;Ubuntu), Heroku.
ru: Я разработчик сайтов: Python, Django, HTML, CSS, JavaScript, Bootstrap, SQL, PostgreSQL, MySQL, Linux&nbsp;(Debian,&nbsp;Ubuntu), Heroku.

source: I can create something according to your design, but I am not a designer.
ru: Я могу создать что-то по вашему дизайну, но я не дизайнер.

source: This my level
ru: Это мой уровень

source: This site is for training purposes. If you need a web developer send me a letter.
ru: Этот сайт предназначен для отработки навыков. Если Вам нужно создать сайт, то напишите мне.

source: Send a letter
ru: Написать письмо

source: Django form fields
ru: Поля Django

source: Rich text editors
ru: Редакторы текста

source: These are browser-based WYSIWYG content editors. They bring to the web common word processor features found in desktop editing applications like Microsoft Word and OpenOffice.
ru: Это браузерные WYSIWYG редакторы контента. Они воплощают онлайн основные черты &quot;больших&quot; десктопных приложений для редактирования текста, таких как Microsoft Word и OpenOffice.</p>

source: This is my level as a designer.
ru: Это мой уровень как дизайнера.

source: Back to Bootstrap style
ru: Вернуться к стилю Bootstrap

source: Home
ru: Главная

source: Forms
ru: Формы

source: DateTime fields
ru: Поля выбора

source: Contact
ru: Контакты

source: Thank you for your email.
ru: Спасибо за Ваше сообщение.

source: Thank you for your email. I will answer as soon as possible.
ru: Спасибо за Ваше письмо. Я отвечу как можно быстрее.
